/*---------------------------------------------------------------------
	บทที่ 11
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid จากตาราง Sales.Orders โดยกรองผลลัพธ์
	เฉพาะลูกค้าที่สั่งสินค้าต่างกันมากกว่า 20 สินค้า (โดยดูจากจำนวนคอลัมน์ productid 
	ในตาราง Sales.OrderDetails)
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid จากตาราง Sales.Customers โดยกรองผลลัพธ์
	เฉพาะลูกค้าที่มาจาก USA และไม่ใช่ลูกค้าที่อยู่ในผลลัพธ์ของงานที่ 1
	
	(แนะนำ: ใช้ตัวดำเนินการ EXCEPT)
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid จากตาราง Sales.Orders โดยกรองผลลัพธ์
	เฉพาะลูกค้าที่มียอดสั่งซื้อเกินกว่า $10,000 (คำนวนโดยคอลัมน์ qty, unitprice และ
	discount จากตาราง Sales.OrderDetails)
	 
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์  Lab Exercise 2 - Task 3 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 4
	
	ก๊อปปี้คำสั่ง T-SQL จาก งานที่ 2 ตามด้วยตัวดำเนินการ INTERSECT แล้วตามด้วยคำสั่ง T-SQL
	จากงานที่ 3
		
	สั่งรันคำสั่ง T-SQL เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 4 Result.txt
	
	สังเกตุจำนวนแถวข้อมูลที่ได้รับ
	
	คุณสามารถอธิบายผลลัพธ์ ให้มีความหมายเชิงธุรกิจ ได้อย่างไร ? 
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 5
	
	ก๊อปปี้คำสั่ง T-SQL จากงานที่ 4 ใส่วงเล็บกับ SELECT คู่แรก
	
	
	สั่งรันคำสั่ง T-SQL เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 5 Result.txt 
	สังเกตุจำนวนแถวข้อมูลที่ได้รับ
	
	ผลลัพธ์ต่างจากงานที่ 4 เพราะอะไร ?
	
	ลำดับการประมวลผลของตัวดำเนินการ SET คือ ?
---------------------------------------------------------------------*/

