/*---------------------------------------------------------------------
	บทที่ 11
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productid และ productname จากตาราง Production.Products
	โดยกรองผลลัพธ์ให้แสดงเฉพาะสินค้าที่มี categoryid เท่ากับ
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
	สังเกตุและจดจำจำนวนแถวข้อมูล

---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productid และ productname จากตาราง Production.Products
	โดยกรองเฉพาะสินค้าที่ขายไปเกิน $50,000 

	ต้องคำนวนยอดขายจาก qty, unitprice และ discount จากตาราง Sales.OrderDetails 

	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
	สังเกตุและจดจำจำนวนแถวข้อมูล
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3
	
	นำเอาคำสั่ง SELECT จากงานที่ 1 และ 2 มา UNION กัน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3_1 Result.txt
	
	ผลลัพธ์ที่ได้ มีกี่แถวข้อมูล ? 
	
	เปลี่ยนจาก UNION เป็น UNION ALL แทน 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3_2 Result.txt 
	
	ผลลัพธ์ที่ได้ มีกี่แถวข้อมูล ?  ความแตกต่างระหว่าง UNION กับ UNION ALL คืออะไร ?

---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดง custid และ contactname จากตาราง Sales.Customers
	โดยกรองผลลัพธ์เฉพาะ ลูกค้าที่มียอดซื้อสูงสุด 10 อันดับแรกของเดือนมกราคม 2008 และลูกค้า
	ที่มียอดซื้อสูงสุด 10 อันดับแรกของเดือนกุมภาพันธ์ 2008 มาแสดง
		
	​คำนวนยอดซื้อจากคอลัมน์ val ของวิวชื่อ Sales.OrderValues
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt 
---------------------------------------------------------------------*/

