/*---------------------------------------------------------------------
	บทที่ 05
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid, companyname, contactname, address, 
	city, country และ phone จากตาราง Sales.Customers โดยกรองผลลัพธ์เอาเฉพาะลูกค้า
	ที่มาจาก Brazil
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid, companyname, contactname, address,
	city, country และ phone จากตาราง Sales.Customers โดยกรองผลลัพธ์เอาเฉพาะลูกค้า
	ที่มาจาก Brazil, UK และ USA 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid, companyname, contactname, address,
	city, country และ phone จากตาราง Sales.Customers โดยกรองผลลัพธ์เอาเฉพาะลูกค้า
	ที่ contact name ขึ้นต้นด้วยตัวอักษร A

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 4a
	
	แผนก IT เขียนคำสั่ง T-SQL เพื่อสืบค้นคอลัมน์ custid และ companyname จากตาราง
	Sales.Customers และคอลัมน์ orderid จากตาราง Sales.Orders
	
	
	โดยการคิวรี่ต้อง
		1. การคิวรี่จะต้องแสดงถูกแถวข้อมูลที่มาจากตาราง Sales.Customers
		2. การเปรียบเทียบในประโยค ON จะต้องระบุว่าคอลัมน์ city ต้องเท่ากับ "Paris"
		   ลงไปด้วย	

	สังรันคิวรี่
	เปรียบเทียบผลลัพธ์ ที่ได้กับไฟล์ Lab Exercise 1 - Task 4a Result.txt
---------------------------------------------------------------------*/

SELECT
	c.custid
,	c.companyname
,	o.orderid
FROM Sales.Customers AS c LEFT OUTER JOIN Sales.Orders AS o 
ON c.custid = o.custid AND c.city = N'Paris';

/*---------------------------------------------------------------------
	งานที่ 4b
	
	ก๊อปปี้โค๊ดจากงานที่ 4a แล้วแก้โค๊ดโดยย้ายการเปรียบเทียบคอลัมน์ city จากประโยค ON ไปไว้
	ที่ประโยค WHERE แทน สั่งรันคิวรี่ 
	
	เปรียบเทียบผลลัพธ์ ที่ได้กับไฟล์ Lab Exercise 1 - Task 4b Result.txt 
	
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	
	คำถาม:  ผลลัพธ์ของงานที่ 4a และงานที่ 4b ตรงกันหรือไม่ ? 
			ทำไมการเปรียบเทียบเกิดขึ้นในประโยค ON และ WHERE จึงให้ผลลัพธ์ต่างกัน ?
	
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 5
	
	เขียนคำสั่ง T-SQL เพื่อแสดงลูกค้า (custid และ companyname) จากตาราง Sales.Customers 
	ที่ไม่มีใบสั่งซื้อในตาราง Sales.Orders ใช้ custid จากตาราง Sales.Customers และ custid 
	จากตาราง Sales.Orders ในการจับคู่ระหว่างสองตาราง
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 5 Result.txt
---------------------------------------------------------------------*/

