/*---------------------------------------------------------------------
	บทที่ 05
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers 
	และคอลัมน์ orderid และ orderdate จากตาราง Sales.Orders
	
	โดยกรองผลลัพธ์เอาเฉพาะใบสั่งซื้อตั้งแต่วันที่ April, 1 2008 (กรองบนคอลัมน์ orderdate)

	จากนั้นให้เรียงผลลัพธ์ตาม orderdate จากมากไปหาน้อย และเรียง custid จากน้อยไปหามาก
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 result.txt
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 2
	
	สั่งรันคิวรี่ข้างล่าง แล้วสังเกตผลลัพธ์
	
	จะเกิดข้อผิดพลาดขึ้น คุณได้รับการแจ้งข้อผิดพลาดอะไร ? คุณคิดว่าข้อผิดพลาดเกิดจากอะไร ? 
	(ทิป: ใช้ความรู้เรื่องลำดับการประมวลผลให้เป็นประโยชน์)
	
	
	แก้ไขคำสั่ง SELECT ตามที่คิดว่าจะช่วยให้ไม่เกิดข้อผิดพลาด รันทดสอบอีกครั้ง
		
	สังเกตและเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt
---------------------------------------------------------------------*/

SELECT
	e.empid
,	e.lastname
,	e.firstname
,	e.title
,	e.mgrid
,	m.lastname AS mgrlastname
,	m.firstname AS mgrfirstname
FROM HR.Employees AS e INNER JOIN HR.Employees AS m 
ON e.mgrid = m.empid
WHERE mgrlastname = N'Buck';

/*---------------------------------------------------------------------
	งานที่ 3a

	ก๊อปปี้คำสั่ง T-SQL จากงานที่ 2 แล้วแก้ไขโดยแสดงรายการพนักงานทุกคน โดยเรียงตาม
	First Name ของผู้จัดการ
	
	โดยการเรียงลองใช้ชื่อคอลัมน์ตรง ๆ ก่อน

---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 3b
	
	ลองเปลี่ยนไปใช้ชื่อเล่นของคอลัมน์สำหรับ First Name ของผู้จัดการแทน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ของทั้งคู่ว่าเหมือนหรือต่างกันหรือไม่อย่างไร สามารถเทียบกับ
	ไฟล์ผลลัพธ์ชื่อ Lab Exercise 2 - Task 3a and 3b Result.txt
	
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------

	คำถาม: ทำไมถึงได้ผลลัพธ์ เดียวกัน? 
---------------------------------------------------------------------*/