/*---------------------------------------------------------------------
	บทที่ 05
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ orderid และ orderdate จากตาราง Sales.Orders
	โดยสืบค้น 20 ใบสั่งซื้อล่าสุด เรียงตาม orderdate
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT ให้ได้ผลลัพธ์แบบเดียวกับงานที่ 1 โดยใช้ประโยค OFFSET-FETCH แทน
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับผลลัพธ์ของงานที่ 1
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productname และ unitprice จากตาราง 
	Production.Products
	
	สั่งรันคำสั่ง  T-SQL แล้วสังเกตจำนวนแถวข้อมูลที่ได้รับ
	
	แก้ไขคำสั่ง SELECT โดยเรียงตาม unitprice มากสุด 10 เปอร์เซ็นของจำนวนแถวข้อมูล
	ทั้งหมด
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์  Lab Exercise 3 - Task 3 Result.txt 
	
	สังเกตุจำนวนแถวข้อมูลอีกครั้ง
	
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------

	คำถาม: เป็นไปได้หรือไม่ที่จะใช้ประโยค OFFSET-FETCH แทน?
---------------------------------------------------------------------*/


