/*---------------------------------------------------------------------
	บทที่ 05
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid, orderid และ orderdate จากตาราง 
	Sales.Orders โดยสืบค้น 20 แถวข้อมูลแรก (ใช้ประโยค OFFSET-FETCH)
	ที่เรียงตามคอลัมน์ orderdate และ orderid 
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 1 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 1 แล้วแก้ประโยค OFFSET-FETCH โดยเริ่มจากแถวที่ 20
	นับไปอีก 20 แถว
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 2 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3

	หากคุณได้รับค่าผ่านพารามิเตอร์ชื่อ @pagenum เป็นเลขหน้า และพารามิเตอร์ชื่อ @pagesize
	เป็นจำนวนแถวข้อมูลในแต่ละหน้า คุณจะนำพารามิเตอร์เหล่านี้ไปใช้ในประโยค OFFSET-FETCH
	ได้อย่างไร ? 
	(ไม่ต้องกังวล หากคุณไม่รู้ว่าพารามิเตอร์คืออะไร ลองดูวิธีเขียนใน Solutions ก่อนได้)

---------------------------------------------------------------------*/

