/*---------------------------------------------------------------------
	บทที่ 02
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

--USE TSQL;
--GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	ปิดไฟล์สคริปทุกไฟล์
	เปิดไฟล์สคริป T-SQL ชื่อ Lab Exercise 2.sql สั่งรันทั้งสคริป
	จะเกิดข้อผิดพลาดขึ้น คุณได้รับการแจ้งข้อผิดพลาดอะไร ? คุณคิดว่าข้อผิดพลาดเกิดจากอะไร ? 
---------------------------------------------------------------------*/

SELECT  
	firstname
,	lastname
,	city
,	country
FROM HR.Employees
WHERE country = 'USA';

/*---------------------------------------------------------------------
	งานที่ 2
	
	ลองปรับเปลี่ยนอะไรก็ตามให้สคริปทำงานได้โดยไม่มีข้อผิดพลาด
	(แนะนำ: ปัญหาไม่ได้อยู่ที่คำสั่ง SELECT ลองดูชื่อฐานข้อมูลใน Databases box) 
	
	สังเกตผลลัพธ์ สังเกตว่าผลลัพธ์ที่ได้มีจำนวนแถวน้อยกว่า ในแบบฝึกหัดที่ 1 งานที่ 2
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 3
	
	จากการฟังบรรยายบทที่ 2 มาจะพบว่าสคริปมีทั้ง Comment แบบ -- เพื่อ Comment ไปจน
	สิ้นสุดบรรทัด หรือใช้ /* */ เพื่อ Comment เป็นบล็อค โดยตลอด   
	
	ลองเอา Comment หน้าคำสั่ง USE TSQL; ก่อนงาน 1 ออกไป
	
	จากนั้นทำการ Save และปิดสคริป แล้วลองเปิดสคริปนี้ใหม่ จากนั้นลองสั่งรันทั้งสคริปอีกครั้ง
	
	คำถาม: ทำไมการรันคราวนี้ไม่พบข้อผิดพลาด ?
	
	สังเกตชื่อฐานข้อมูลใน Databases box 
---------------------------------------------------------------------*/
