/*---------------------------------------------------------------------
	บทที่ 02
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เรียกใช้ SQL Server Management Studio (SSMS) เพื่อเชื่อมต่อไปยัง MIA-SQL 
	โดยใช้ Windows authentication
	
	เปิดไฟล์สคริป T-SQL ชื่อ Lab Exercise 1.sql 
	(จาก Solution Explorer ภายใต้ Project ชื่อ Exercises)
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 2
	
	สั่งรันสคริปโดยคลิกปุ่ม Execute ที่อยู่บน Toolbar (หรือกด F5 บนคีย์บอร์ด)
	จะเป็นการสั่งรันทั้งสคริป (หากไม่ไฮไลท์บางส่วนของโค๊ด)
	
	สังเกตผลลัพธ์
---------------------------------------------------------------------*/

SELECT  
	firstname, lastname, city, country
FROM HR.Employees;

/*---------------------------------------------------------------------

	คำถาม: ฐานข้อมูลที่ปรากฎใน Databases box คือฐานข้อมูลอะไร ?

---------------------------------------------------------------------*/

/*---------------------------------------------------------------------
	งานที่ 3
	
	ไฮไลท์เฉพาะคำสั่ง SELECT ในงานที่ 2 แล่วสั่งรันอีกครั้ง
	
	สังเกตผลลัพธ์ น่าจะได้ผลลัพธ์เดียวกันกับ งานที่ 2 
	
	ทิป: สามารถไฮไลท์บางส่วนของโค๊ดได้โดยกดปุ่ม Alt ค้างไว้ 
		แล้วลากสี่เหลี่ยมรอบโค๊ดที่ต้องการรัน
---------------------------------------------------------------------*/
