/*---------------------------------------------------------------------
	บทที่ 02
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

--USE TSQL;
--GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	สังเกตดูผลลัพธ์ 
	คำถาม: ทำไมผลลัพธ์ถึงเป็นหน้าต่างว่าง ๆ ?
---------------------------------------------------------------------*/

/*
SELECT	
	firstname
,	lastname
,	city
,	country
FROM HR.Employees
WHERE country = 'USA'
ORDER BY lastname;
*/

/*---------------------------------------------------------------------
	งานที่ 2
	
	สังเกตว่าคำสั่ง USE และคำสั่ง SELECT ถูก Comment ไว้ 
		
	เอา Comment ทั้งสองคำสั่งออก
	
	จากนั้นสั่งรันเฉพาะคำสั่ง USE 

	และตามด้วยสั่งรันคำสั่ง SELECT สังเกตว่าผลลัพธ์ที่ได้มีจำนวนแถวข้อมูลเท่ากับใน
	แบบฝึกหัดที่ 1 งานที่ 2 แต่มีการจัดเรียงตามคอลัมน์ lastname 
---------------------------------------------------------------------*/
