/*---------------------------------------------------------------------
	บทที่ 10
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เหมือนกับแบบฝึกหัดที่ 3 งานที่ 1 แต่เปลี่ยนจาก derived table เป็น 
	CTE แทน โดยให้ CTE ชื่อ ProductBeverages
		
	สั่งรันคำสั่ง  T-SQL แล้วเปรียบเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 1 Result.txt 
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง T-SQL เพื่อสร้าง CTE ชื่อ c2008 ประกอบด้วยคอลัมน์ custid และ salesamt2008
	เป็นการหายอดสั่งซื้อของลูกค้าแต่ละรายในปี 2008 โดยสืบค้นข้อมูลจากวิวชื่อ Sales.OrderValues
	
	จากนั้นนำเอา CTE ไป join กับตาราง Sales.Customers ใน SELECT หลัก โดยให้แสดงรายการ
	ลูกค้าทุกคน ไม่ว่าจะมียอดสั่งซื้อหรือไม่ก็ตาม ให้มีคอลัมน์ดังนี้
		- custid
		- contactname
		- salesamt2008

	สั่งรันคำสั่ง  T-SQL แล้วเปรียบเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 2 Result.txt 
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT หลัก เพื่อแสดงคอลัมน์ต่อไปนี้ 
		- custid และ contactname จากตาราง Sales.Customers
		- salesamt2008 เป็นยอดสั่งซื้อของลูกค้าในปี 2008
		- salesamt2007 เป็นยอดสั่งซื้อของลูกค้าในปี 2007
		- percentgrowth (ยอดปี 2008-ยอดปี 2007)/ยอดปี 2007 *100.00
		  ถ้า percentgrowth มีค่าเป็น NULL ให้แสดงค่าเป็น 0

	salesamt2008 และ salesamt2007 ได้มาจากสอง CTE สำหรับค่ามูลแต่ละปี
	
	สั่งรันคำสั่ง  T-SQL แล้วเปรียบเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 3 Result.txt
---------------------------------------------------------------------*/

