/*---------------------------------------------------------------------
	บทที่ 10
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productid, productname, supplierid, unitprice
	และ discontinued จากตาราง Production.Products โดยกรองผลลัพธ์เฉพาะสินค้าที่มี
	ชนิดสินค้าเป็น Beverages (categoryid เท่ากับ 1)
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
	
	จากนั้นนำคำสั่ง SELECT ที่ได้ไปสร้างเป็นวิวชื่อ Production.ProductBeverages
	
	สั่งรันคำสั่ง  T-SQL เพื่อสร้างวิว
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productid และ productname จากวิวที่สร้างขึ้นในงานที่ 1
	(Production.ProductsBeverages) โดยกรองผลลัพธ์เฉพาะ supplierid เท่ากับ 1
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 3
	
	แผนก IT ได้แก้ไขวิวจากงานที่ 1 โดยเพิ่มประโยค ORDER BY ลงไป
	
	สั่งรันคำสั่งข้างล่าง เกิดอะไรขึ้น ? คุณได้รับการแจ้งข้อผิดพลาดหรือไม่ เพราะเหตุใด ?
	
	แก้ไขอีกครั้ง โดยเพิ่มออปชั่น TOP (100) PERCENT ลงในประโยค SELECT
	
	สั่งรันคำสั่งที่แก้ไข สังเกตผลลัพธ์
		
---------------------------------------------------------------------*/

ALTER VIEW Production.ProductsBeverages 
AS
	SELECT
		productid
	,	productname
	,	supplierid
	,	unitprice
	,	discontinued
	FROM Production.Products
	WHERE categoryid = 1
	ORDER BY productname;

GO
/*---------------------------------------------------------------------
	งานที่ 4
	
	แผนก IT ได้แก้ไขวิวจากงานที่ 1 โดยเพิ่มคอลัมน์สำหรับแสดงว่าเป็นสินค้าราคาแพงหรือไม่

	สั่งรันคำสั่งข้างล่าง เกิดอะไรขึ้น ? คุณได้รับการแจ้งข้อผิดพลาดหรือไม่ เพราะเหตุใด ?

	ทำการแก้ไขให้คำสั่ง T-SQL ไม่เกิดข้อผืดพลาด
		
---------------------------------------------------------------------*/

ALTER VIEW Production.ProductsBeverages 
AS
	SELECT
		productid
	,	productname
	,	supplierid
	,	unitprice
	,	discontinued
	,	CASE 
			WHEN unitprice > 100. THEN N'high' 
			ELSE N'normal' 
		END
	FROM Production.Products
	WHERE categoryid = 1;

GO

/*---------------------------------------------------------------------
	งานที่ 5
	
	รันคำสั่งข้างล่าง เพื่อลบวิวที่สร้างขึ้น
---------------------------------------------------------------------*/

IF OBJECT_ID(N'Production.ProductsBeverages', N'V') IS NOT NULL
	DROP VIEW Production.ProductsBeverages;
