/*---------------------------------------------------------------------
	บทที่ 10
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ productid และ productname จาก derived table
	ที่ได้มาจากคำสั่ง SELECT ภายในวิวใน แบบฝึกหัดที่ 1 งานที่ 4 จากนั้นกรองผลลัพธ์เฉพาะ
	ที่ pricetype มีค่าเป็น High มาแสดง 
	
	อย่าลืมเรื่องชื่อเล่นของ derived table (แนะนำให้ใช้ p เป็นชื่อเล่น)
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงยอดสั่งซื้อ และยอดเฉลี่ยการสั่งซื้อของลูกค้าแต่ละราย โดยมีคอลัมน์
	ดังต่อไปนี้
		- custid แสดงลูกค้าแต่ละราย
		- totalsalesamount แสดงแสดงยอดสั่งซื้อของลูกค้า
		- avgsalesamount แสดงยอดเฉลี่ยการสั่งซื้อของลูกค้า

	โดย totalsalesamount, avgsalesamount นั้นคำนวนมากจากยอดขายแต่ละใบสั่งซื้อ ซึ่ง
	เขียนเป็น derived table มีรายละเอียดคือเป็นการหาผลรวมแต่ละใบสั่งซื้อ โดยคำนวนจาก 
	qty, unitprice และ discount และตั้งชื่อคอลัมน์ว่า totalsalesamountperorder

	อย่าลืมเรื่องชื่อเล่นของ derived table 

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ต่อไปนี้
		- orderyear แสดงปีปัจจุบัน
		- curtotalsales แสดงยอดขายของปีปัจจุบัน
		- prevtotalsales แสดงยอดขายของปีก่อนหน้า
		- percentgrowth แสดงเปอร์เซ็นการเติบโตของยอดขายปีปัจจุบันเทียบกับปีก่อนหน้า
		  (แนะนำ: (ยอดปีปัจจุบัน-ยอดปีก่อนหน้า)/ยอดปีก่อนหน้า*100.00 )
	
	ต้องใช้ derived tables สองตัวคือสำหรับปีปัจจุบัน และปีก่อนหน้า โดยทั้งสองตัวเพิ่อเป็นหา
	ผลรวมยอดขายรายปีออกมาจากวิวชื่อ Sales.OrderValues	โดยข้อมูลปี (orderyear) 
	มาจากคอลัมน์ orderdate ส่วนยอดขาย (totalsalesamount) มาจากคอลัมน์ val 
	
	อย่าลืมเรื่องชื่อเล่นของ derived table 
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt

---------------------------------------------------------------------*/
