/*---------------------------------------------------------------------
	บทที่ 03
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname และ contacttitle จากตาราง 
	Sales.Customers ที่กำหนดชื่อเล่นเป็น "C" โดยใช้ชื่อเล่นของตารางนำหน้าคอลัมน์ทั้งสอง
	ใน SELECT list ประโยชน์ที่ได้คือทำให้อ่านง่ายและเขียนโค๊ดสั้น โดยจะเห็นเป็นประโยชน์
	มากขึ้นในบทที่ 4 การ Join ตาราง
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname, contacttitle และ companyname
	จากตาราง Sales.Customers กำหนดชื่อเล่นของคอลัมน์ตามลำดับคือ Name, Title และ
	Company Name เพื่อง่ายต่อการทำความเข้าใจ
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt 
	
	สังเกตว่าได้ชื่อคอลัมน์ตามต้องการ
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคิวรี่เพื่อแสดงคอลัมน์ productname จากตาราง Production.Products กำหนดชื่อเล่น
	ของตารางเป็น "P"  และชื่อเล่นของคอลัมน์เป็น "Product Name"
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 4
	
	นักพัฒนาได้เขียนคิวรี่เพื่อสืบค้นสองคอลัมน์ (city และ region) จากตาราง Sales.Customers 
	แต่เมื่อสั่งรันกลับแสดงเพียงคอลัมน์เดียว 

	สิ่งที่คุณต้องทำคือ วิเคราะห์หาข้อผิดพลาด แล้วแก้ไขให้แสดงสองคอลัมน์ได้ถูกต้อง
	
	สั่งรันแล้วสังเกตผลลัพธ์
---------------------------------------------------------------------*/

SELECT city country
FROM Sales.Customers;


/*---------------------------------------------------------------------	
	คำถาม:  ทำไมในตอนแรกถึงแสดงเพียงคอลัมน์เดียว ?
			Best Practice สำหรับลดข้อผิดพลาดต้องทำอย่างไร ?
---------------------------------------------------------------------*/