/*---------------------------------------------------------------------
	บทที่ 03
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL โดยแสดงเพียงคอลัมน์ country จากตาราง Sales.Customers 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 1 แล้วแก้ไขโค๊ดให้แสดงเฉพาะค่าที่ distinct แล้ว
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt
	
	คำถาม:  ผลลัพธ์ที่ได้จากงานที่ 1 มีกี่แถวข้อมูล ?
			ผลลัพธ์ที่ได้จากงานที่ 2 มีกี่แถวข้อมูล ?
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	สองคิวรี่ต่อไปนี้เป็นการสืบค้นจากตาราง Sales.Customers

	คำถาม:  ทั้งสองคิวรี่ได้ผลลัพธ์เดียวกันหรือไม่ ?
			ประโยค DISTINCT กระทำกับทุกคอลัมน์ หรือเพียงคอลัมน์แรก ?
---------------------------------------------------------------------*/

SELECT city, region 
FROM Sales.Customers;

SELECT DISTINCT city, region 
FROM Sales.Customers;
