/*---------------------------------------------------------------------
	บทที่ 03
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เรียกใช้ SSMS เชื่อมต่อไปยัง MIA-SQL โดยใช้ Windows authentication 
	(ถ้าเชื่อมต่อไปยัง SQL Server บน On-premise) 
	หรือใช้ SQL Server authentication 	(หากเป็นการเชื่อมไปยัง SQL Azure)
	
	บน Object Explorer ไปที่ฐานข้อมูล TSQL และโฟลเดอร์ Tables 
	
	สังเกตชื่อของตารางต่าง ๆ ใน schema ชื่อ Sales
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อสืบค้นทุกแถวข้อมูลและทุกคอลัมน์จากตาราง Sales.Customers
	ทิป: สามารถ drag-and-drop ชื่อตารางหรือคอมลัมน์จาก Object Explorer ได้
		ไม่ต้องเขียนเอง
	
	สั่งรันคำสั่งที่เขียนและเปรียบเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 3
	
	บน Object Explorer ไปที่ตาราง Sales.Customers จากนั้นเปิดดูโฟลเดอร์ Column 
	สังเกตทุกคอลัมน์ในตาราง
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname, address, postalcode, city
	และ country
	
	สั่งรันคำสั่งที่เขียนเสร็จ เปรียบเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
	
	คำถาม: จำนวนแถวข้อมูลที่ได้เท่ากับเท่าไหร่? 

	ทิป:	คำสั่ง SELECT ที่เขียนเป็นการสืบค้นทั้งตาราง เพราะฉะนั้นจำนวนแถวข้อมูลจะเท่ากับจำนวนแถว
		ข้อมูลที่มีทั้งหมดในตาราง
	
---------------------------------------------------------------------*/

