/*---------------------------------------------------------------------
	บทที่ 03
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ categoryid และ productname จากตาราง 
	Production.Products
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	ปรับปรุงคำสั่ง SELECT จากงานที่ 1 โดยเพิ่มคอลัมน์ใหม่ชื่อ "categoryname" ที่สร้างจากนิพจน์ 
	CASE เพื่อแสดงผลลัพธ์เป็น Category Name โดยดูจากค่า Category ID 
	(นำค่ามาจากตาราง Production.Categories) หากค่าใดไม่ตรงให้แสดงผลเป็น "Other"
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3
	ปรับปรุงคำสั่ง SELECT จากงานที่ 2 โดยเพิ่มคอลัมน์ใหม่ชื่อ "iscampaign" โดยจะแสดงผลเป็น 
	"Campaign Products" ในกรณีเป็นสินค้าประเภท Beverages, Produce, และ Seafood 
	ส่วนสินค้าประเภทอื่นให้แสดงเป็น "Non-Campaign Products"	
---------------------------------------------------------------------*/


