/*---------------------------------------------------------------------
	บทที่ 07
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ชื่อ  productdesc จากตาราง Production.Products
	โดยคอลัมน์ productdesc นั้นสร้างจากคอลัมน์ productname และคอลัมน์ unitprice ให้
	แสดงผลดังนี้
	 
		The unit price for the Product HHYDP is 18.00 $.
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 5 - Task 1 Result.txt
	
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------

	คำถาม:  คุณต้องใช้ฟังก์ชัน CAST หรือ CONVERT บ้างหรือไม่ หรือมีแบบอื่นดีกว่าหรือไม่ ? 
		
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 2
	
	แผนกการตลาดต้องการข้อมูลในช่วง 1 เมษายน ค.ศ.2007 จนถึง 30 พฤศจิกายน ค.ศ.2007
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ orderid, orderdate, shippeddate และ shipregion
	จากตาราง Sales.Orders 
	
	โดยกรองผลลัพธ์ให้อยู่ในช่วงวันที่กำหนด และวันที่ส่งสินค้ามากกว่าวันที่สั่งซื้อเกิน 30 วัน
	หาก shipregion ไหนไม่มีค่าให้แสดงเป็น 'No region' แทน

	สามารถใช้ฟังก์ชัน CONVERT โดยกำหนด style หรือฟังก์ชัน PARSE โดยกำหนด Culture ได้
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 5 - Task 2 Result.txt 
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 3
	
	แผนก IT ต้องการแปลงข้อมูลเบอร์โทรศัพท์ในตาราง Sales.Customers ไปเป็น Integer 
	ทั้งนี้จะต้องเอา ขีดกลาง, วงเล็บเปิด วงเล็บปิด และ space ออกไปก่อนจะแปลงข้อมูล
	
	
	เขียนคำสั่ง SELECT ให้เป็นไปตามความต้องการของแผนก IT การแปลงจะต้องไม่เกิดข้อผิดพลาด
	หากพบข้อผิดพลาดให้แสดงเป็น NULL แทน ให้ชื่อเล่นคอลัมน์นี้ว่า PhoneasINT
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ และเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 5 - Task 3 Result.txt
---------------------------------------------------------------------*/


