/*---------------------------------------------------------------------
	บทที่ 06
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	
	เขียนคำสั่ง SELECT โดยประกอบไปด้วยคอลัมน์ต่อไปนี้
		- วันเวลาปัจจุบัน ใช้ชื่อเล่นว่า currentdatetime
		- วันปัจจุบัน ใช้ชื่อเล่นว่า currentdate
		- เวลาปัจจุบัน ใช้ชื่อเล่นว่า currenttime
		- ปีปัจจุบัน ใช้ชื่อเล่นว่า currentyear
		- เลขเดือน ใช้ชื่อเล่นว่า currentmonth
		- เลขวันของเดือน ใช้ชื่อเล่นว่า currentday
		- เลขสัปดาห์ของปี ใช้ชื่อเล่นว่า currentweeknumber
		- ชื่อเดือน โดยใช้ค่าเดียวกันกับ currentdatetime ในการแปลง ใช้ชื่อเล่นว่า currentmonthname
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
	
	ผลลัพธ์จะแตกต่างจากในไฟล์เพราะต่างวันและเวลากัน ใช้เป็นแนวทางเท่านั้น
		
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	คำถาม:  คุณสามารถนำเอาชื่อเล่นเช่น currentdatetime ไปใส่ในฟังก์ชันเพื่อได้คอลัมน์ 
			currentdate ได้หรือไม่ เพราะเหตุใด ? 
---------------------------------------------------------------------*/

/*---------------------------------------------------------------------
	งานที่ 2
	 
	ทำการแปลงวันที่  December 11, 2015 ไปเป็นคอลัมน์ที่มีชนิดข้อมูล date โดยเขียนด้วย
	T-SQL แบบไหนก็ได้ อาทิ ใช้ฟังก์ชัน cast, convert หรือฟังก์ชันอื่นใด มา 3 คำสั่ง
	โดยให้มีชื่อเล่นคอลัมน์เป็น somedate ในทุก ๆ คำสั่ง
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT โดยประกอบไปด้วยคอลัมน์ต่อไปนี้
		- วันเวลาในอีก 3 เดือนข้างหน้านับจากวันเวลาปัจจุบัน ใช้ชื่อเล่นว่า threemonths
		- จำนวนของวันปัจจุบันนับไปถึงวันในอีก 3 เดือนข้างหน้า ใช้ชื่อเล่นว่า diffdays
		- จำนวนสัปดาห์ระหว่างวันที่ April 4, 1992 ถึงวันที่ September 16, 2011 
		  ใช้ชื่อเล่นว่า diffweeks
		- วันแรกของเดือนปัจจุบัน ใช้ชื่อเล่นว่า firstday
		 	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt 
	บางผลลัพธ์จะแตกต่างจากในไฟล์เพราะต่างวันและเวลากัน ใช้เป็นแนวทางเท่านั้น
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 4
	
	แผนก IT ได้เขียนคำสั่ง T-SQL เพื่อสร้างและใส่ข้อมูลในตารางชื่อ Sales.Somedates
		
	สั่งรันสคริป T-SQL ที่เตรียมให้ 
	
	จากนั้นเขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ isitdate และเพิ่มคอลัมน์ชื่อ converteddate
	โดยคอลัมน์ดังกล่าวแปลงข้อมูลคอลัมน์ isitdate ไปเป็นชนิดข้อมูล date ถ้าแปลงได้ หาก
	แปลงไม่ได้ให้แสดงค่าเป็น NULL
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt
	
---------------------------------------------------------------------*/

SET NOCOUNT ON;

DROP TABLE IF EXISTS Sales.Somedates;

CREATE TABLE Sales.Somedates (
	isitdate varchar(9)
);

INSERT INTO Sales.Somedates (isitdate) VALUES 
	('20110101'),
	('20110102'),
	('20110103X'),
	('20110104'),
	('20110105'),
	('20110106'),
	('20110107Y'),
	('20110108');

SET NOCOUNT OFF;

SELECT isitdate
FROM Sales.Somedates;





/*---------------------------------------------------------------------
	งานที่ 5
	
	รันคำสั่งข้างล่างนี้ เพราะลบตาราง Sales.Somedates ทิ้ง
---------------------------------------------------------------------*/

DROP TABLE Sales.Somedates;