/*---------------------------------------------------------------------
	บทที่ 06
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname จากตาราง Sales.Customers
	และเพิ่มคอลัมน์ที่ตัดสายอักษรจากคอลัมน์ contactname โดยนับจากตำแหน่งตัวอักษรแรก 
	ไปจนถึงตำแหน่งตัวอักษรก่อนเครื่องหมาย comma ให้มีชื่อเล่นคอลัมน์ว่า lastname 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 1 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname จากตาราง Sales.Customers โดยนำ
	เครื่องหมาย comma ออก แทนที่ด้วยตัวอักษรที่เป็นค่าว่าง ตัวชื่อเล่นใหม่ว่า newcontactname
	และเพิ่มคอลัมน์ที่ตัดสายอักษรจากคอลัมน์ contactname โดยนับจากตำแหน่งตัวอักษรหลัง
	เครื่องหมาย comma ไปจนถึงตำแหน่งตัวอักษรสุดท้ายของสายอักษร ให้มีชื่อเล่นคอลัมน์ว่า 
	firstname 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 2 Result.txt
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid จากตาราง Sales.Customers และเพิ่ม
	คอลัมน์ที่นำเอา custid มาแสดงโดยให้มีความยาว 6 ตัวอักษรคงที่ โดยต้องขึ้นต้นด้วยตัวอักษร
	'C' และเลข 0 ตัวอย่างเช่น C00001, C00012 หรือ C00123 เป็นต้น
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 3 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname จากตาราง Sales.Customers และเพิ่ม
	คอลัมน์แสดงจำนวนการนับตัวอักษร 'a' ภายใน contactname ว่ามีจำนวนเท่าไหร่ ให้ชื่อเล่น
	คอลัมน์ว่า numberofA (แนะนำ: ลองใช้ฟังก์ชัน REPLACE ร่วมกับ LEN ดู)
	จากนั้นเรียงผลลัพธ์คอลัมน์ numberofA จากมากไปหาน้อย
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 4 Result.txt
---------------------------------------------------------------------*/
