/*---------------------------------------------------------------------
	บทที่ 06
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid ที่ถูก distinct จากตาราง Sales.Orders
	โดยกรองผลลัพธ์เฉพาะใบสั่งซื้อในเดือน February ปี 2008
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT โดยประกอบไปด้วยคอลัมน์ต่อไปนี้
		- วันเวลาปัจจุบัน 
		- วันแรกของเดือนปัจจุบัน
		- วันสุดท้ายของเดือนปัจจุบัน
	 	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt 
	ผลลัพธ์จะแตกต่างจากในไฟล์เพราะต่างวันและเวลากัน ใช้เป็นแนวทางเท่านั้น
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ orderid, custid และ orderdate จากตาราง 
	Sales.Orders โดยกรองผลลัพธ์เฉพาะใบสั่งซื้อก่อนสิ้นเดือนไม่เกิน 5 วัน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 3 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ productid ที่ถูก distinct มาจากการ Join ตาราง 
	Sales.Orders และตาราง Sales.OrderDetails เข้าด้วยกัน
	โดยกรองผลลัพธ์เฉพาะเฉพาะใบสั่งซื้อ 10 สัปดาห์แรกของปี 2007
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 4 Result.txt
---------------------------------------------------------------------*/
