/*---------------------------------------------------------------------
	บทที่ 07
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers
	เพิ่มคอลัมน์ segmentgroup ที่สร้างจากฟังก์ชัน IIF โดยจะแสดงผลเป็น 'Target group' 
	หากเป็นลูกค้าที่มาจาก Mexico และ contact title เป็น 'Owner' หากไม่ตรงตามเงื่อนไขให้
	แสดงผลเป็น 'Other'

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 6 - Task 1 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 2
	
	แก้ไขคำสั่ง T-SQL จากงานที่ 1 โดยเปลี่ยนให้ 'Target group' คือลูกค้าทุกคนที่ region
	ไม่ใช่ NULL หรือ contact title เป็น 'Owner' หากไม่ตรงตามเงื่อนไขให้แสดงผลเป็น 
	'Other'
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 6 - Task 2 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers
	เพิ่มคอลัมน์ segmentgroup ที่สร้างจากฟังก์ชัน CHOOSE โดยมีค่าดังนี้
	
	('Group One', 'Group Two', 'Group Three', 'Group Four')
	
	เพื่อแสดงว่าลูกค้าแต่ละรายอยู่กลุ่มไหน ให้คำนวนโดยคำนวน modulo ของ custid
	(โดยใช้นิพจน์ต่อไปนี้ custid % 4 + 1)

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 6 - Task 3 Result.txt
---------------------------------------------------------------------*/

