/*---------------------------------------------------------------------
	บทที่ 06
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ contactname และ city จากตาราง Sales.Customers
	โดยนำคอลัมน์มา Concatenate กันมีรูปแบบดังนี้
	
		Allen, Michael (city: Berlin)
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง T-SQL จากงานที่ 1 แก้ไขโดยเพิ่มคอลัมน์ region เข้าไป ให้มีรูปแบบดังนี้
		
		Richardson, Shawn (city: Sao Paulo, region: SP)

	แต่หาก region มีค่าเป็น NULL ให้มีรูปแบบดังนี้
		
		Allen, Michael (city: Berlin, region: )
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname และ contacttitle จากตาราง 
	Sales.Customers โดยกรองผลลัพธ์เฉพาะลูกค้าที่ contact name ขึ้นต้นด้วยตัวอักษร
	'A' ถึง 'G'
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt 
	สังเกตุจำนวนแถวข้อมูล
---------------------------------------------------------------------*/

