/*---------------------------------------------------------------------
	บทที่ 07
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname และ fax จากตาราง Sales.Customers
	ถ้าเบอร์ Fax มีค่าเป็น NULL ให้แสดงผลเป็น 'No information'
	
	เขียน 2 คำสั่ง โดยคำสั่งที่หนึ่งใช้ฟังก์ชัน COALESCE และคำสั่งที่สองใช้ฟังก์ชัน ISNULL
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 7 - Task 1 Result.txt 
	
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	คำถาม:  ความแตกต่างของฟังก์ชัน COALESCE และ ISNULL คืออะไร ?
---------------------------------------------------------------------*/

/*---------------------------------------------------------------------
	งานที่ 2
	
	แก้ไขคำสั่ง T-SQL ที่เตรียมให้โดยเพิ่มประโยค WHERE เข้าไปเพื่อกรองผลลัพธ์เฉพาะ region
	ที่ตรงกับค่าของตัวแปร @region ควรมีการตรวจสอบค่า NULL ของทั้งคอลัมน์ และตัวแปร

---------------------------------------------------------------------*/

DECLARE @region AS NVARCHAR(30) = NULL; 

SELECT 
	custid, region
FROM Sales.Customers;

GO

DECLARE @region AS NVARCHAR(30) = N'WA'; 

SELECT 
	custid, region
FROM Sales.Customers;


/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ contactname, city และ region จากตาราง
	Sales.Customers โดยกรองผลลัพธ์เฉพาะ region ไม่ใช่ตัวย่อ (2 ตัวอักษร) หรือ
	region มีค่าเป็น NULL

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 7 - Task 3 Result.txt 
	สังเกตุจำนวนแถวข้อมูล
---------------------------------------------------------------------*/

