/*---------------------------------------------------------------------
	บทที่ 13
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	สร้าง CTE ชื่อ OrderRows โดยเป็นการ SELECT เพื่อแสดงคอลัมน์ orderid, orderdate 
	และ val จากวิวชื่อ Sales.OrderValues แล้วใช้ฟังก์ชัน ROW_NUMBER (Window Function) 
	สร้างคอลัมน์ rowno โดยเรียงตามคอลัมน์ orderdate และ orderid

	จากนั้นเขียน SELECT หลัก โดยนำเอา CTE มา LEFT JOIN ตัวเอง โดยจับคู่ระหว่างแถวปัจจุบัน
	กับแถวก่อนหน้า แล้วแสดงคอลัมน์ต่อไปนี้
		- orderid ของแถวปัจจุบัน
		- orderdate ของแถวปัจจุบัน
		- curval เป็นยอดของแถวปัจจุบัน
		- prevval เป็นยอดของแถวก่อนหน้า
		- diffprev ยอดแตกต่างระหว่าง แถวปัจจุบัน กับ แถว่อนหน้า 
		  (ยอดของแถวปัจจุบัน-ยอดของแถวก่อนหน้า)
	
	สั่งรันคำสั่ง  T-SQL เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT โดยใช้ฟังก์ชัน LAG เพื่อให้ได้ผลลัพธ์เหมือนกับงานที่ 1 และไม่ใช้ CTE 
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt 
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	สร้าง CTE ชื่อ SalesMonth2007 เพื่อแสดงยอดขายในแต่ละเดือนของปี 2007 โดยแสดงคอลัมน์
		- monthno คำนวนจากคอลัมน์ orderdate 
		- val คำนวนจากคอลัมน์ val เป็นยอดขายในแต่ละเดือน
	โดยสืบค้นจากวิวชื่อ Sales.OrderValues
	
	จากนั้นเขียน SELECT หลัก สืบค้นข้อมูลจาก CTE โดยแสดงคอลัมน์ต่อไปนี้
		- monthno
		- val
		- avglast3months หาค่าเฉลี่ย3 เดือนก่อนหน้า ของ val 
		- diffjanuary ค่า val เดือนปัจจุบัน ต่างจากเดือนมกราคมเท่าไหร่
		- nextval ค่า val เดือนถัดไป
			
	สั่งรันคำสั่งที่เขียนและเปรียบเทียบผลลัพธ์s ที่คุณได้กับไฟล์ Lab Exercise 2 - Task 3 Result.txt 

	สังเกตว่า การคำนวนค่าเฉลี่ย3 เดือนก่อนหน้า ไม่ถูกต้อง
---------------------------------------------------------------------*/
