/*---------------------------------------------------------------------
	บทที่ 12
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ orderid, orderdate และ val จากวิวชื่อ 
	Sales.OrderValues แล้วใช้ฟังก์ชัน ROW_NUMBER (Window Function) สร้างคอลัมน์
	rowno โดยเรียงตามคอลัมน์ orderdate
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง T-SQL จากงานที่ 1 แล้วสร้างคอลัมน์ rankno เพิ่มเติม โดยใช้ฟังก์ชัน RANK 
	เรียงตามคอลัมน์ orderdate
	
	สั่งรันคำสั่งที่แก้ไขแล้ว เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt. 
	
	จะเห็นว่ามีค่าในคอลัมน์ rowno และ rankno แตกต่างกัน
	
	ความแตกต่างระหว่างฟังก์ชัน RANK และ ROW_NUMBER คืออะไร ?
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ orderid, orderdate, custid และ val จากวิวชื่อ 
	Sales.OrderValues แล้วใช้ฟังก์ชัน RANK (Window Function) สร้างคอลัมน์ orderrankno
	โดยมีการแบ่งพาทิชั่นตามลูกค้าแต่ละราย และเรียงข้อมูลตามคอลัมน์ val จากมากไปหาน้อย
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดคอลัมน์ custid, orderyear (คำนวนมาจาก orderdate)
	และ val จากวิวชื่อ Sales.OrderValues แล้วใช้ฟังก์ชัน DENSE_RANK (Window Function) 
	สร้างคอลัมน์ orderrankno โดยมีการแบ่งพาทิชั่นตามลูกค้าแต่ละรายในแต่ละปี และเรียงข้อมูล
	ตามคอลัมน์ val จากมากไปหาน้อย
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 5
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 4 แล้วแก้ไขโดยกรองเฉพาะ 2 อันดับแรกจาก orderrankno
	มาแสดง
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 5 Result.txt
---------------------------------------------------------------------*/
