/*---------------------------------------------------------------------
	บทที่ 12
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid, orderid, orderdate และ val จาก
	วิวชื่อ Sales.OrderValues แล้วใช้ฟังก์ชัน Window Function สร้างคอลัมน์ชื่อ
	percoftotalcust เป็นการหาว่า val คิดเป็นกี่เปอร์เซ็นภายในพาร์ติชันที่แบ่งโดย custid
	
	จากนั้นเรียงข้อมูลตาม custid จากน้อยไปหามา และ percoftotalcust จากมากไปหาน้อย
	
 	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt 
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 1 แล้วเพิ่มคอลัมน์ runval โดยใช้ Window Function
	หาผลบวกสะสม ของคอลัมน์ val โดยแบ่งพาร์ติชันตามคอลัมน์ custid แล้วเรียงข้อมูลภายใน
	พาร์ติชันตาม orderdate และ orderid และการเลื่อน Framing ในการคำนวน 

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt 
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้ CTE ชื่อ SalesMonth2007 จากงานที่  3 แบบฝึกหัดที่ 2

	จากนั้นเขียน SELECT หลัก สืบค้นข้อมูลจาก CTE โดยแสดงคอลัมน์ต่อไปนี้
		- monthno
		- val
		- avglast3months หาค่าเฉลี่ย3 เดือนก่อนหน้า ของ val 
		- ytdval เป็น val ที่บวกสะสมคนถึงเดือนปัจจุบัน
	
	โดยการหา avglast3months จะใช้ฟังก์ชัน AVG และการเลื่อน Framing ในการคำนวน
	ส่วน ytdval จะใช้ฟังก์ชัน SUM และการเลื่อน Framing ในการคำนวนเช่นกัน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt
---------------------------------------------------------------------*/



