/*---------------------------------------------------------------------
	บทที่ 08
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงยอดรวมใบสั่งซื้อ แต่ละ orderid (แนะนำ: นำเอา qty, unitprice
	และ discount จากตาราง Sales.OrderDetails มาคำนวน) 
	โดยให้มีคอลัมน์ดังนี้ orderid, orderdate และ salesamount
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/









/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง T-SQL จากงานที่ 1 แก้ไขโดยเพิ่มการนับจำนวนรายการในใบสังซื้อแต่ละใบเข้าไปให้
	ชื่อคอลัมน์ว่า nooforderlines และเพิ่มการหาค่าเฉลี่ยของยอดรายการในใบสั่งซื้อให้ชื่อคอลัมน์
	ว่า avgsalesamountperorderline
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงยอดขายในแต่ละเดือน โดยประกอบด้วยคอลัมน์
		- yearmonthno คำนวนมาจาก orderdate โดยแสดงในรูปแบบ YYYYMM
		- saleamountpermonth คำนวนมาจาก qty, unitprice และ discount 
		  จากตาราง Sales.OrderDetails
	 และเรียงข้อมูลตามคอลัมน์ yearmonthno
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 3 Result.txt
---------------------------------------------------------------------*/







/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงยอดสั่งซื้อของลูกค้าแต่ละราย (แสดงรายชื่อลูกค้าที่ไม่เคยสั่งซื้อด้วย)
	โดยประกอบด้วยคอลัมน์
		- custid จากตาราง Sales.Customers
		- contactname จากตาราง Sales.Customers
		- totalsalesamount คำนวนมาจาก qty, unitprice และ discount 
		  จากตาราง Sales.OrderDetails
		- maxsalesamountperorderline รายการในใบสั่งซื้อที่มูลค่าสูงสุด
		- numberofrows จำนวนแถวข้อมูล
		- numberoforderlines จำนวนรายการในใบสั่งซื้อ
	ทั้งนี้ให้เรียงข้อมูลตามคอลัมน์ totalsalesamount จากน้อยไปหามาก   		
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 4 Result.txt
	
---------------------------------------------------------------------*/

