/*---------------------------------------------------------------------
	บทที่ 08
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงลูกค้า 10 อับดับแรกที่มียอดเกิน $10,000 โดยแสดงคอลัมน์
	ต่อไปนี้
		- custid แสดงลูกค้าแต่ละราย
		- totalsalesamount แสดงยอดสั่งซื้อของลูกค้าแต่ละราย 
	โดยเรียงข้อมูลตามคอลัมน์ totalsalesamount จากมากไปหาน้อย

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 1 Result.txt 
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง T-SQL เพื่อแสดงยอดรวมใบสั่งซื้อแต่ละใบในปี 2008 โดยแสดงคอลัมน์ต่อไปนี้
		- orderid
		- empid
		- totalsalesamount แสดงยอดรวมรวมใบสั่งซื้อแต่ละใบ
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 2 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้คำสั่ง T-SQL จาก งานที่ 2 แล้วกรองผลลัพธ์เอาเฉพาะยอดรวมรวมใบสั่งซื้อที่มูลค่าเกิน $10,000
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 3_1 Result.txt

	
	จากนั้นเพิ่มการกรองอีก เอาเฉพาะใบสั่งซื้อที่ขายโดยพนักงานที่มี empid เท่ากับ 3
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 3_2 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงรายละเอียดของลูกค้าที่มีการสั่งซื้อมากกว่า 25 ครั้ง โดยแสดงคอลัมน์
	ต่อไปนี้
		- custid
		- lastorderdate แสดงวันสั่งซื้อล่าสุด
		- totalsalesamount ยอดสั่งซื้อของลูกค้า
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 4 Result.txt
---------------------------------------------------------------------*/



