/*---------------------------------------------------------------------
	บทที่ 13
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ country, city จากตาราง Sales.Customers และ
	สร้างคอลัมน์ noofcustomers เพื่อนับจำนวนลูกค้า
	
	โดยการนับจำนวนจะเป็นการนับตาม เมืองและประเทศ, ประเทศอย่างเดียว, เมืองอย่างเดียว และ
	นับลูกค้าทั้งหมด โดยผลรวมทั้ง 4 แบบอยู่ใน grouping sets
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง T-SQL สืบค้นข้อมูลจากวิวชื่อ Sales.OrderValues โดยมีคอลัมน์ต่อไปนี้
		- orderyear แสดงเลขปี คำนวนจากคอลัมน์ orderdate
		- ordermonth แสดงเลขเดือน คำนวนจากคอลัมน์ orderdate
		- orderday แสดงเลขวันที่ของเดือน คำนวนจากคอลัมน์ orderdate
		- salesvalue แสดงยอดขาย
	
	แสดง grouping sets ทุกแบบที่เป็นไปได้กับคอลัมน์ orderyear, ordermonth
	และ orderday
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt 
	สังเกตผลลัพธ์ และจดจำจำนวนแถวข้อมูล
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 2 แล้วเป็นประโยคย่อย CUBE ไปเป็น ROLLUP
		
	สั่งรันคำสั่งที่แก้ไข เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
	สังเกตผลลัพธ์ และจดจำจำนวนแถวข้อมูล
	
	ความแตกต่างระหว่างประโยคย่อย CUBE และ ROLLUP คืออะไร ?
	
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 4
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 2 แล้วลบคอลัมน์ orderday ออกจาก SELECT list และ
	grouping sets
	
	จากนั้นเพิ่มคอลัมน์ groupid เข้าไปเป็นคอลัมน์แรกใน SELECT list โดยคอลัมน์นี้ได้
	มาจากฟังก์ชัน GROUPING_ID ที่ตรวจสอบทั้งคอลัมน์ orderyear และ ordermonth

	ให้เรียงผลลัพธ์ตามคอลัมน์ groupid, orderyear และ ordermonth
	
	
	สั่งรันคำสั่งที่แก้ไข เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt
---------------------------------------------------------------------*/











