/*---------------------------------------------------------------------
	บทที่ 08
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	นักพัฒนาน้องใหม่ได้เตรียมคำสั่ง T-SQL เพื่อนับใบสั่งซื้อและจำนวนลูกค้าในแต่ละปี
	
	รันแล้วสังเกตผลลัพธ์
	
	คำถาม:  ผลลัพธ์ที่ได้ ใช่ผลลัพธ์ที่ถูกต้องหรือไม่ ทำไมถึงนับจำนวนใบสั่งซื้อและจำนวนลูกค้าได้
			เท่ากันตลอด ?
	
	แก้ไขให้การนับจำนวนลูกค้าในแต่ละปีถูกต้อง แล้วสั่งรันคำสั่งที่เขียนเสร็จ
	เทียบผลลัพธ์ที่ได้กับไฟล์  Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/

SELECT
	YEAR(orderdate) AS orderyear 
,	COUNT(orderid) AS nooforders 
,	COUNT(custid) AS noofcustomers
FROM Sales.Orders 
GROUP BY YEAR(orderdate);

/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงจำนวนลูกค้าที่มีตัวอักษรใน contactname ตัวแรกเป็นตัวเดียวกัน
	และนับจำนวนใบสั่งซื้อที่มีตัวอักษรใน contactname ตัวแรกเป็นตัวเดียวกันด้วย สรุปคือให้มี
	คอลัมน์ต่อไปนี้
		- firstletter แสดงตัวอักษรตัวแรกของ contactname
		- noofcustomers แสดงจำนวนของลูกค้าที่มีตัวอักษรใน contactname ตัวแรกเป็นตัวเดียวกัน
		- nooforders แสดงจำนวนใบสั่งซื้อที่มีตัวอักษรใน contactname ตัวแรกเป็นตัวเดียวกัน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้คำสั่ง T-SQL จากแบบฝึกหัดที่ 1 งานที่ 5 แก้ไขโดยเพิ่มคอลัมน์ต่อไปนี้
		- totalsalesamount แสดงยอดสั่งซื้อในแต่ละประเภทสินค้า
		- nooforders แสดงจำนวนใบสั่งซื้อ
		- avgsalesamountperorder แสดงยอดสั่งซื้อต่อหนึ่งใบสั่งซื้อ
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt
---------------------------------------------------------------------*/
