/*---------------------------------------------------------------------
	บทที่ 08
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อสืบค้นรายการลูกค้าที่ซื้อสินค้าจากพนักงานที่มี empid เทากับ 5
	โดยคอลัมน์ custid มาจากตาราง Sales.Orders และคอลัมน์ contactname มาจาก
	ตาราง Sales.Customers การ Group by ทำกับทั้งสองคอลัมน์

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้คำสั่ง T-SQL จาก งานที่ 2 และแก้ไขโดยการเพิ่มคอลัมน์ city ที่มาจากตาราง 
	Sales.Customers ลงไปใน SELECT List แล้วสังรันเลย

	คุณได้รับการแจ้งข้อผิดพลาด 

	คำถาม:  ข้อผิดพลาดเกิดจากอะไร ?
	
	แก้ไขให้ไม่เกิดข้อผิดพลาด
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
---------------------------------------------------------------------*/

-- error






-- fixed







/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ orderyear ที่คำนวนมาจาก orderdate 
	จากตาราง Sales.Orders โดยกรองผลลัพธ์เฉพาะใบสั่งซื้อที่ขายโดยพนักงานที่มี empid เท่ากับ 5
	การ Group by ทำกับทั้งสองคอลัมน์ และเรียงตามคอลัมน์ทั้งสองตามลำดับ

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 5
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ categoryid และ categoryname จากตาราง 
	Production.Categories โดยแสดงเพราะประเภทสินค้าที่ขายได้ในปี 2008 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 5 Result.txt
---------------------------------------------------------------------*/
