/*---------------------------------------------------------------------
	บทที่ 03
	
	แบบฝึกหัด 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
งานที่ 2
---------------------------------------------------------------------*/

SELECT *
FROM Sales.Customers;

GO

/*---------------------------------------------------------------------
	พยายามหลีกเลี่ยงการใช้ * โดยระบุคอลัมน์ที่ต้องการใน SELECT List หากต้องการรายการ
	คอลัมน์ทุกคอลัมน์ ให้เลือก drag-and-drop โฟลเดอร์ Column แทน
---------------------------------------------------------------------*/
SELECT 
	custid
,	companyname
,	contactname
,	contacttitle
,	[address]
,	city
,	region
,	postalcode
,	country
,	phone
,	fax
FROM Sales.Customers;

GO

---------------------------------------------------------------------
-- งานที่ 3
---------------------------------------------------------------------

SELECT 
	contactname
,	[address]
,	postalcode
,	city
,	country
FROM Sales.Customers;

GO



