/*---------------------------------------------------------------------
	บทที่ 04
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	สั่งรันคิวรี่ข้างล่าง แล้วสังเกตผลลัพธ์ จะเกิดข้อผิดพลาด 
	
---------------------------------------------------------------------*/

SELECT 
	custid
,	contactname
,	orderid
FROM Sales.Customers INNER JOIN Sales.Orders 
ON Customers.custid = Orders.custid;

/*---------------------------------------------------------------------
	คำถาม: เป็นข้อผิดพลาดอะไร ? คุณคิดว่าข้อผิดพลาดเกิดจากอะไร ? 
---------------------------------------------------------------------*/


/*---------------------------------------------------------------------
	งานที่ 2
	
	จากคำสั่งในงานที่ 1 ไม่มีการใช้ชื่อเล่นตาราง ยังคงใช้แบบนี้ต่อไปในงานที่ 2
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 1 แก้ไขให้คำสั่ง SELECT ไม่มีข้อผิดพลาด แล้วสั่งรัน
	
	สังเกตผลลัพธ์ที่ได้เทียบกับไฟล์ Lab Exercise 2 - Task 2 Result.txt 
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 3
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 2 แก้ไขโดยให้ตาราง Sales.Custumers มีชื่อเล่น "c" 
	และตาราง Sales.Orders มีชื่อเล่น "o"
	
	สั่งรันคำสั่งที่เขียนเสร็จ และเทียบผลลัพธ์ที่ได้กับผลลัพธ์ของงานที่ 2

---------------------------------------------------------------------*/




/*---------------------------------------------------------------------	
	
	ทดลองเปลี่ยนไปใช้ชื่อตาราง แทนชื่อเล่นตาราง ที่ประกาศหน้าคอลัมน์ แล้วสั่งรันอีกครั้ง
		
	คำถาม: ทำไมถึงเกิดข้อผิดพลาด ?
	
---------------------------------------------------------------------*/




/*---------------------------------------------------------------------
	งานที่ 4
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 3 แก้ไขโดยเพิ่ม 3 คอลัมน์ productid, qty และ unitprice
	จากตาราง Sales.OrderDetails
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 4 Result.txt 
---------------------------------------------------------------------*/


