/*---------------------------------------------------------------------
	บทที่ 04
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productname จากตาราง Production.Products
	(ให้มีชื่อเล่น "p") และคอลัมน์ categoryname จากตาราง Production.Categories 
	(ให้มีชื่อเล่น "c") โดยใช้ inner join 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	คำถาม:  คอลัมน์ที่ใช้เปรียบเทียบในประโยค ON ของการ join ตารางคืออะไร ? และเพราะเหตุใด ?
			
			หากมีแถวข้อมูลใหม่ในตาราง Production.Categories แต่ไม่มีแถวข้อมูลในตาราง
			Production.Products ใดเลยที่สัมพันธ์กับประเภทสินค้าใหม่นี้เลย หากใช้คำสั่ง
			SELECT ในงานที่ 1 นี้ จะแสดงรายการของประเภทสินค้าใหม่นี้หรือไม่ จงอธิบาย ?
---------------------------------------------------------------------*/