/*---------------------------------------------------------------------
	บทที่ 04
	
	แบบฝึกหัดที่ 4
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers 
	และคอลัมน์ orderid จากตาราง Sales.Orders โดยคำสั่งต้องสืบค้นทุกแถวข้อมูลจากตาราง
	Sales.Customers
	
	สั่งรันคำสั่งที่เขียนเสร็จเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 4 - Task 1 Result.txt
	
	สังเกตุคอลัมน์ orderid ว่าไม่มีค่าบ้างหรือไม่ (แสดงเป็นค่า NULL) ? และเพราะเหตุใด? 
---------------------------------------------------------------------*/






