/*---------------------------------------------------------------------
	บทที่ 04
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เพื่อความเข้าใจการทำงานของ Self-Reference ก่อนอื่นให้เขียนคำสั่ง T-SQL เพื่อแสดงคอลัมน์ 
	empid, lastname, firstname, title และ mgrid จากตาราง HR.Employees
	
	สั่งรันคำสั่งที่เขียนเสร็จเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
	
	หมายเหตุ: คอลัมน์ mgrid เป็น Foreign Key ที่อ้างอิงไปยัง empid ซึ่งเป็น Primairy Key

---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	ก๊อปปี้คำสั่ง SELECT จากงานที่ 1 แล้วแก้ไขโดยเพิ่มคอลัมน์สำหรับข้อมูลของผู้จัดการ 
	(lastname, firstname) โดยใช้ self-join

	โดยให้ชื่อคอลัมน์เป็น mgrlastname และ mgrfirstname ซึ่งได้รับมาจากชื่อของพนักงาน
	นั่นเอง
	
	สั่งรันคำสั่งที่เขียนเสร็จเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt
	สังเกตุจำนวนแถวข้อมูล
	
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	
	คำถาม:  จำเป็นต้องใช้ชื่อเล่นของตารางหรือไม่ตอนทำ Self-Join ?
			ทำไม่ถึงได้จำนวนแถวข้อมูลน้อยกว่าผลลัพธ์ของงานที่ 1 ? 
		
---------------------------------------------------------------------*/