/*---------------------------------------------------------------------
	บทที่ 09
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers 
	และสร้างคอลัมน์ชื่อ lastorderdate ซึ่งแสดงวันสั่งซื้อล่าสุดของลูกค้าแต่ละราย 
	(แนะนำ: ใช้คิวรี่ย่อยที่สัมพันธ์กับคิวรี่ตัวนอกสืบค้นข้อมูล orderdate จากตาราง Sales.Orders)
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 1 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงลูกค้าที่ไม่มีใบสั่งซื้อเหมือนกับในงานที่ 3 แบบฝึกหัดที่ 2
	แต่ใช้เป็น คิวรี่ย่อยที่สัมพันธ์กับคิวรี่ตัวนอก และประโยค EXISTS แทน
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 2 Result.txt

---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	คำถาม: ทำไมไม่ต้องตรวจสอบ NULL เหมือนกับที่ใช้ประโยค IN กรณีคิวรี่ย่อยที่จบในตัวเอง ?
---------------------------------------------------------------------*/

/*---------------------------------------------------------------------
	งานที่ 3
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers 
	เฉพาะลูกค้าที่ซื้อสินค้าหลัง 1 เมษายน 2008 และสั่งสินค้ามูลค่าเกิน 100$ ขึ้นไป
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 3 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ต่อไปนี้
		- orderyear แสดงปีที่ขาย
		- totalsales แสดงยอดขายรายปี
		- runsales แสดงยอดขายสะสม

	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 3 - Task 4 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 5
	
	ลบแถวข้อมูลที่สร้างไว้ในแบบฝึกหัดที่ 2 สั่งรันคำสั่งข้างล่าง
---------------------------------------------------------------------*/

DELETE Sales.Orders
WHERE custid IS NULL;


