/*---------------------------------------------------------------------
	บทที่ 09
	
	แบบฝึกหัดที่ 1
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงวันสั่งซื้อล่าสุดจากตาราง Sales.Orders โดยให้ชื่อคอลัมน์ว่า lastorderdate 
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 1 Result.txt
---------------------------------------------------------------------*/





/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ orderid, orderdate, empid และ custid จาก
	ตาราง Sales.Orders โดยกรองเอาเฉพาะใบสั่งซื้อในวันล่าสุด (แนะนำ: ใช้คิวรี่ย่อยแบบจบ
	ในตัวเองที่ได้มาจากงานที่ 1)
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 2 Result.txt
---------------------------------------------------------------------*/






/*---------------------------------------------------------------------
	งานที่ 3
	
	แผนก IT ได้เขียนคำสั่ง T-SQL ข้างล่างเพื่อสืบค้นใบสั่งซื้อจากลูกค้าที่มี contact name ขึ้นต้น
	ด้วยตัวอักษร I สั่งรันคิวรี่ และสังเกตผลลัพธ์
	
	แก้ไขคิวรี่โดยเปลี่ยนเป็นลูกค้าที่มี contact name ขึ้นต้นด้วยตัวอักษร B แทน สั่งรันคิวรี่
	
	
	เกิดอะไรขึ้น ? คุณได้รับการแจ้งข้อผิดพลาดหรือไม่ อย่างไร ?
	
	แก้ไขเท่าที่จำเป็น เพื่อให้คำสั่ง T-SQL รันได้ โดยไม่มีข้อผิดพลาด
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 3 Result.txt
---------------------------------------------------------------------*/

SELECT
	orderid
,	orderdate
,	empid
,	custid
FROM Sales.Orders
WHERE custid	= 
				(
					SELECT custid
					FROM Sales.Customers
					WHERE contactname LIKE N'I%'
				);

/*---------------------------------------------------------------------
	งานที่ 4
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ orderid จากตาราง Sales.Orders และคอลัมน์ที่สร้างขึ้น
	ดังต่อไปนี้ 
		- totalsalesamount เป็นยอดขายของแต่ละใบสั่งซื้อ
		- salespctoftotal คำนวนเปอร์เซ็นยอดขายของแต่ละใบสั่งซื้อเทียบกับยอดทั้งหมด
		  (แนะนำ: ใช้คิวรี่ย่อยแบบจบในตัวเอง)
	 
	ทั้งนี้เป็นยอดของเดือน พฤษภาคม ปี 2008 เท่านั้น
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 1 - Task 4 Result.txt
---------------------------------------------------------------------*/

