/*---------------------------------------------------------------------
	บทที่ 09
	
	แบบฝึกหัดที่ 2
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ productid และ productname จากตาราง 
	Production.Products โดยกรองผลลัพธ์เฉพาะสินค้าที่ถูกสั่งซื้อมากกว่า 100 ชิ้น
	ต่อหนึ่งใบสั่งซื้อ
		
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 1 Result.txt
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 2
	
	เขียนคำสั่ง SELECT เพื่อแสดงคอลัมน์ custid และ contactname จากตาราง Sales.Customers
	ไม่เคยสั่งซื้อสินค้าเลย (แนะนำ: ใช้คิวรี่ย่อยแบบจบในตนเอง)
	
	
	สั่งรันคำสั่งที่เขียนเสร็จ เทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 2 Result.txt 
	สังเกตุและจำ จำนวนแถวข้อมูล ที่ได้
---------------------------------------------------------------------*/



/*---------------------------------------------------------------------
	งานที่ 3
	
	แผนก IT ได้เขียนคำสั่ง T-SQL เพื่อเพิ่มแถวข้อมูลเข้าไป โดยแถวข้อมูลนี้ล custid มีค่าเป็น
	NULL สั่งรันคำสั่งข้างล่าง

	จากนั้นก๊อปปี้คำสั่ง T-SQL จากงานที่ 2 แล้วสั่งรันทันที 
	
	สังเกตผลลัพธ์ จำนวนแถวข้อมูลที่ได้มีเท่าไหร่ ? เพราะเหตุใด
	
	แก้ไขคำสั่ง เพื่อให้ได้ผลลัพธ์เหมือนกับงานที่ 2 อีกครั้ง (แนะนำ: ต้องไม่มีข้อมูลที่มีค่าเป็น NULL 
	ในคิวรี่ย่อย)

	สั่งรันคำสั่งที่แก้ไขแล้ว และเทียบผลลัพธ์ที่ได้กับไฟล์ Lab Exercise 2 - Task 3 Result.txt
---------------------------------------------------------------------*/

INSERT INTO Sales.Orders 
(custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, 
shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
VALUES
(NULL, 1, '20111231', '20111231', '20111231', 1, 0, 
'ShipOne', 'ShipAddress', 'ShipCity', 'RA', '1000', 'USA');

GO

