/*---------------------------------------------------------------------
	บทที่ 06
	
	แบบฝึกหัดที่ 3
---------------------------------------------------------------------*/

USE TSQL;
GO

/*---------------------------------------------------------------------
	งานที่ 1
---------------------------------------------------------------------*/

SELECT TOP (20)
	orderid
,	orderdate
FROM Sales.Orders
ORDER BY orderdate DESC;

/*---------------------------------------------------------------------
	งานที่ 2
---------------------------------------------------------------------*/

SELECT 
	orderid
,	orderdate
FROM Sales.Orders
ORDER BY orderdate DESC
OFFSET 0 ROWS FETCH FIRST 20 ROWS ONLY;


/*---------------------------------------------------------------------
	งานที่ 3
---------------------------------------------------------------------*/

SELECT TOP (10) PERCENT
	 productname
,	unitprice
FROM Production.Products
ORDER BY unitprice DESC;